---
kind: property
id: P:Autodesk.Revit.DB.NurbSpline.Degree
zh: 度、角度
source: html/576634fc-1b35-aabd-4518-d6c6d1f343ff.htm
---
# Autodesk.Revit.DB.NurbSpline.Degree Property

**中文**: 度、角度

Returns the degree of the nurb spline.

## Syntax (C#)
```csharp
public int Degree { get; }
```